Derppening/stm32f103/inc/config/test_config.h
#ifndef STM32F103_CONFIG_TEST_CONFIG_H_
#define STM32F103_CONFIG_TEST_CONFIG_H_

#include "stm32f10x.h"
#include "stm32f10x_gpio.h"

#define LIB_USE_LED 3
#define LIB_LED1_PINOUT {GPIOB, GPIO_Pin_12}
#define LIB_LED2_PINOUT {GPIOB, GPIO_Pin_13}
#define LIB_LED3_PINOUT {GPIOB, GPIO_Pin_14}

#define LIB_USE_BUTTON 2
#define LIB_BUTTON1_PINOUT {GPIOB, GPIO_Pin_6}
#define LIB_BUTTON2_PINOUT {GPIOB, GPIO_Pin_7}

#define LIB_USE_UART 1
#define LIB_UART1_TX_PINOUT {GPIOA, GPIO_Pin_9}
#define LIB_UART1_RX_PINOUT {GPIOA, GPIO_Pin_10}

#define LIB_USE_TFT 1
#define LIB_TFT1_SCK_PINOUT {GPIOA, GPIO_Pin_5}
#define LIB_TFT1_MISO_PINOUT {GPIOA, GPIO_Pin_6}
#define LIB_TFT1_MOSI_PINOUT {GPIOA, GPIO_Pin_7}
#define LIB_TFT1_SS_PINOUT {GPIOA, GPIO_Pin_4}
#define LIB_TFT1_DEPS {TFT1, RCC_APB2Periph_TFT1, LIB_TFT1_SCK_PINOUT, LIB_TFT1_MISO_PINOUT, LIB_TFT1_MOSI_PINOUT, LIB_TFT1_SS_PINOUT}

#endif  // STM32F103_CONFIG_TEST_CONFIG_H_
